# <center> Lab Exercise 3: Getting started with Pandas </center>
<center>
Humberto Díaz <br>
The University of Winnipeg <br>
DIT 54102 AIW01: Foundations of Data Science <br>
Muhammad Shahin PhD. <br>
March 30, 2025 
</center>


Reading, selecting, filtering,manipulating, sorting, grouping, rearranging, ranking, plotting data.

## Learning Objectives
Learn how to use Pandas for data science applications - read, select, filter, manipulate, sort, group, rearrange, rank and plot data.

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
"""
plt.style.use('seaborn-whitegrid')  
plt.rc('text', usetex=True)  
plt.rc('font', family='times')  
plt.rc('xtick', labelsize=10)  
plt.rc('ytick', labelsize=10)  
plt.rc('font', size=12) 
"""

"\nplt.style.use('seaborn-whitegrid')  \nplt.rc('text', usetex=True)  \nplt.rc('font', family='times')  \nplt.rc('xtick', labelsize=10)  \nplt.rc('ytick', labelsize=10)  \nplt.rc('font', size=12) \n"

## Creating a new DataFrame

In [6]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],  
'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 
'RMadrid', 'RMadrid', 'ValenciaCF',  
'ValenciaCF', 'ValenciaCF'],  
'wins': [30, 28, 32, 29, 32, 26, 21, 17, 19],  
'draws': [6, 7, 4, 5, 4, 7, 8, 10, 8],  
'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]  
}  
football = pd.DataFrame(  
data, columns=['year', 'team', 'wins', 'draws', 'losses'])  
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

#### Question 1: re-create the DataFrame above using the from_dict method.

In [8]:
football_from_dict = pd.DataFrame.from_dict(data)
football_from_dict = football_from_dict[['year', 'team', 'wins', 'draws', 'losses']]  # Reorder columns
football_from_dict

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

## Reading tabular data

In [10]:
edu = pd.read_csv('education_analysis.csv', na_values=':', usecols=['TIME', 'GEO', 'Value'])
print("\nFirst 5 rows of education data:")
edu.head()

First 5 rows of education data:

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

#### Question 2: read any other file from your hard drive with format other than csv into q_2 DataFrame.

## Viewing Data

#### Question 3: Calculate the average and standard deviation values of column ‘Value’ in edu DataFrame.

## Selection

#### Question 4: Calculate the ceil of the scalar sqrt(Value) in the previous example

#### Question 5: Calculate the mean of the values for each country per year